app/views/articles/index.html.erb

              <p class="text-right">
                <%= article.comments.count %> Comentarios
---
SELECT COUNT(*) FROM "comments"  WHERE "comments"."article_id" = ?  [["article_id", 7]]