app/controllers/articles_controller.rb

	def create
		@article = Article.new(article_params)

  		if @article.save
---
INSERT INTO "articles" ("author", "created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Sebas"], ["created_at", "2014-12-03 16:31:08.691385"], ["text", "Hola Mundo"], ["title", "Articulo"], ["updated_at", "2014-12-03 16:31:08.691385"]]

	def index
  		@articles = Article.all
  		@lastfive = Article.order('created_at DESC').limit(5)
---
SELECT "articles".* FROM "articles"
SELECT  "articles".* FROM "articles"   ORDER BY created_at DESC LIMIT 5